{
    "Goblin":{
        "Name": "Goblin",
        "Description": "Goblins wield a crude spear and attack from melee range. Individually, they are relatively weak but can pose a threat in large numbers.",
        "Flavortext": "Aberrations that have manifested from dark mana, summoned by an event known as the Awakening. These humanoid creatures have constructed rudimentary tools, clothing, and a tribal system. These particular ones seem to fulfill the role of soldiers in their tribes."
    },
    "BowGoblin" :{
        "Name": "Goblin Bowyer",
        "Description": "Goblins with a bow and arrow to shoot enemies from afar. They are dangerous at range, but they lack fighting power and defense up close.",
        "Flavortext": "Goblins who have been exposed to larger amounts of dark mana during the Awakening gain a slight, but not insignificant, increase in their intelligence levels and are able to perform more complex tasks such as crafting bows and hunting food for their tribe."
    },
    "ShamanGoblin":{
        "Name": "Goblin Shaman",
        "Description": "Casts magic orbs to heal goblins and other beasts from a distance, and teleports away when a foe closes in. The healing orb has a travel time, and they can't heal other shaman goblins.",
        "Flavortext": "Shamans are the apex of their tribes, as they manage tribe affairs and serve as protectors of their tribe. They possess a wealth of experience in ancient spells and show much higher levels of intelligence and dark mana concentration compared to their peers. They dyed several parts of their bodies and wore animal tooth charms as a sign of power. Their rudimentary staff seems to serve as a catalyst for their magic."
    },
    "Bat": {
        "Name": "Bat",
        "Description": "Bats float over you, dropping crimson projectiles from above to deal damage. They have little to no defense when attacked mid-air.",
        "Flavortext": "Lesser accumulations of dark mana managed to form organic living matter and manifested as winged creatures with lust for blood. They use their venom-laced droppings to incapacitate their prey. You will find plenty of them inhibiting murky dungeons and caverns."
    },
    "WitchGoblin": {
        "Name": "Goblin Witch",
        "Description": "Witches cast homing orbs that weaken your attacks and call down deadly lightning strikes from a distance.",
        "Flavortext": "An intelligent spellcaster who commands dark mana to perform their evil biddings. Witches are shunned from their tribes because of their destructive practices, so they often strike deals with other goblins. In exchange for a place to study their spellbook and magical ingredients, Witches would protect goblin settlements."
    },
    "Slime": {
        "Name": "Slime",
        "Description": "Slimes move back-and-forth in a horizontal line, damaging you on contact.",
        "Flavortext": "Slimes are oozing, gelatinous, semi-translucent amalgamations of dark mana. They wander aimlessly, feeding on mana-rich creatures as nourishment."
    },
    "FireSlime": {
        "Name": "Fire Slime",
        "Description": "Slimes move back-and-forth in a horizontal line, damaging you on contact. Fire slimes are immune to Fire damage and explode in a burst of flames shortly after death.",
        "Flavortext": "Their volatile, explosive properties are speculated to be due to prolonged stays in hot environments such as volcanoes and deserts."
    },
    "Spider": {
        "Name": "Spider",
        "Description": "Spiders cling to floors or ceilings, crawling in their facing direction, damaging you on contact.",
        "Flavortext": "These critters scavenge the dungeon's vegetation for sustenance, seeking small critters and plants to eat and, if its lucky enough, leftover mana from deposits or recently deceased creatures. They have small, claw-like appendages beneath their feet that allow them to stick to surfaces."
    },
    "ElderSpider": {
        "Name": "Elder Spider",
        "Description": "Elder spiders cling to floors or ceilings, crawling in their facing direction, damaging you on contact and spraying its venom to poison you.",
        "Flavortext": "As they mature, spiders start to produce venom, which they can use to incapacitate larger prey. Their skin also grows thicker, forming a carapace that protects them."
    }

}